# Pandas Tutorial

# Observed
- A pandas series is some form of array/list that representing a single colunm/ row
- you can perform python list manupulations and operations such as append, drop,slicing
- A periond may follw the closing bracket

In [2]:
import pandas as pd

In [3]:
#check mdule
print(pd.__version__)

0.25.1

# Series: Create, Manipulate, querry, delete

In [4]:
#Creating a series from a list

list1 = [3,4,5,6,7,8]
s1 = pd.Series(list1) #creates a series from a list
s1 #no need for print statement i jupyter

0    3
1    4
2    5
3    6
4    7
5    8
dtype: int64

In [5]:
#specify the index
list2 = ['a','b','c','e','f','g']
s2 = pd.Series(list1, index=list2)
s2

a    3
b    4
c    5
e    6
f    7
g    8
dtype: int64

In [6]:
#creating a Series using a NumPy arrray
index = ['a','b','c','d','e']
import numpy as np
array1 = np.random.randn(5) #generate a 1D numpy array with 5 elements
series1 = pd.Series(array1, index = index)
series1
array1

array([-1.34102035, -0.92409968, -0.66207119, -1.06937493, -1.98365411])

In [7]:
#creating a Series from a python dictionary
dict1 = {'a':1,'b':10,'c':9,'d':20,'e':7}

series2 = pd.Series(dict1)
series2

a     1
b    10
c     9
d    20
e     7
dtype: int64

In [8]:
#series slicing
series3 = series2[:2]
series3

a     1
b    10
dtype: int64

In [9]:
#Series operations
a = pd.Series([1,2,3,4,5,6,7])
b = pd.Series([7,8,9,0,3,4,5])

In [10]:
#addition
c = a+b
c

0     8
1    10
2    12
3     4
4     8
5    10
6    12
dtype: int64

In [11]:
# or
c = a.add(b)

# similaryly, use mul,div and sub

In [12]:
#max(),min(),median(),average() e.t.c

#maximum example
y = max(c)
print(y)

12

# Creating Dataframe from Series

In [13]:
#our  index/row headings
rows = pd.date_range('today',periods = 6) #pandas function to generate a date list
#our column headings
columns = ['A','B','C','D']
#Generating random  cell data using NumPy
cell_data = np.random.randn(6,4) # 6 rows by 4 columns

#Creating the DataFrame
df1 = pd.DataFrame(cell_data,columns = columns, index = rows)
df1

                                   A         B         C         D
2020-03-09 19:28:50.314438 -0.677385  0.173890  1.153407 -1.360121
2020-03-10 19:28:50.314438 -0.525046 -0.098488  0.855382 -0.222842
2020-03-11 19:28:50.314438 -0.320895  0.588594 -0.480694  0.880028
2020-03-12 19:28:50.314438  0.230224 -0.518019 -0.459667  0.760513
2020-03-13 19:28:50.314438  0.370621 -2.262205 -1.756981 -0.715509
2020-03-14 19:28:50.314438  1.876031 -1.838673  0.175840 -1.386309

In [14]:
#DataFrame from pyhton Dictionary

data = {'animal':['cat','cat','snake','dog','dog','rat'],
        'age':[2.4,5.7,5.0,4,3,2.3],
       'visits':[2,4,2,1,7,5],
       'priority':['yes','yes','no','yes','no','no']}
row_headers = ['a','b','c','d','e','f']
df2 = pd.DataFrame(data,index = row_headers)
df2

  animal  age  visits priority
a    cat  2.4       2      yes
b    cat  5.7       4      yes
c  snake  5.0       2       no
d    dog  4.0       1      yes
e    dog  3.0       7       no
f    rat  2.3       5       no

In [15]:
#check datatypes
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [16]:
df2.head(2) # first two rows

  animal  age  visits priority
a    cat  2.4       2      yes
b    cat  5.7       4      yes

In [17]:
df2.tail(3) #last 3 rows

  animal  age  visits priority
d    dog  4.0       1      yes
e    dog  3.0       7       no
f    rat  2.3       5       no

**In the code that follows, pd.index, pd.columns and pd.values 
are not functions but objects. For that, they got no brackets**

In [18]:
df2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [19]:
df2.columns

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [20]:
df2.values

array([['cat', 2.4, 2, 'yes'],
       ['cat', 5.7, 4, 'yes'],
       ['snake', 5.0, 2, 'no'],
       ['dog', 4.0, 1, 'yes'],
       ['dog', 3.0, 7, 'no'],
       ['rat', 2.3, 5, 'no']], dtype=object)

In [21]:
#Transposing the DataFrame
df2.T

            a    b      c    d    e    f
animal    cat  cat  snake  dog  dog  rat
age       2.4  5.7      5    4    3  2.3
visits      2    4      2    1    7    5
priority  yes  yes     no  yes   no   no

In [22]:
df2

  animal  age  visits priority
a    cat  2.4       2      yes
b    cat  5.7       4      yes
c  snake  5.0       2       no
d    dog  4.0       1      yes
e    dog  3.0       7       no
f    rat  2.3       5       no

In [23]:
#describing data
#gives a descriotion for each numerical column
df2.describe()

            age    visits
count  6.000000  6.000000
mean   3.733333  3.500000
std    1.408072  2.258318
min    2.300000  1.000000
25%    2.550000  2.000000
50%    3.500000  3.000000
75%    4.750000  4.750000
max    5.700000  7.000000

In [24]:
#sorting
df2.sort_values('visits')

  animal  age  visits priority
d    dog  4.0       1      yes
a    cat  2.4       2      yes
c  snake  5.0       2       no
b    cat  5.7       4      yes
f    rat  2.3       5       no
e    dog  3.0       7       no

In [25]:
#Daframe slicing(selecting rows), equivalent to df.iloc
df2[2:3]

  animal  age  visits priority
c  snake  5.0       2       no

In [26]:
#Quering columns
#Notice that the index takes in a list
df2[['age','visits']]

   age  visits
a  2.4       2
b  5.7       4
c  5.0       2
d  4.0       1
e  3.0       7
f  2.3       5

In [27]:
#indexing an address
#loc is for loction
df2.loc['c','age'] = "2"
df2

  animal  age  visits priority
a    cat  2.4       2      yes
b    cat  5.7       4      yes
c  snake    2       2       no
d    dog    4       1      yes
e    dog    3       7       no
f    rat  2.3       5       no

In [28]:
#Check for nullValues
df2.isnull()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False  False   False     False
e   False  False   False     False
f   False  False   False     False

In [29]:
#Changing the column datatype
#Use a dictionry(can perform multiple)
df2 = df2.astype({"age":'int'})

In [30]:
#all sums
df2.sum()

animal      catcatsnakedogdograt
age                           18
visits                        21
priority         yesyesnoyesnono
dtype: object

# series operations

In [31]:
#Dataframe Series sum
df2['age'].sum()

18

# string Operations

In [32]:
#Fist we introduce a null type
string = pd.Series(['a','c','d',np.nan,'f','g',np.nan])
string.str.upper() #convert to upper case

0      A
1      C
2      D
3    NaN
4      F
5      G
6    NaN
dtype: object

# Operations on DataFrames with missing Values

In [33]:
data = {'animal':['cat','cat','snake','dog','dog','rat'],
        'age':[2.4,np.nan,5.0,4,3,np.nan],
       'visits':[2,4,2,1,7,5],
       'priority':['yes','yes','no','yes','no','no']}
row_headers = ['a','b','c','d','e','f']
df4 = pd.DataFrame(data,index = row_headers)
df4

  animal  age  visits priority
a    cat  2.4       2      yes
b    cat  NaN       4      yes
c  snake  5.0       2       no
d    dog  4.0       1      yes
e    dog  3.0       7       no
f    rat  NaN       5       no

In [34]:
#Filling NA values
#First find the mean of the other age values
df5 =df4.copy()
y = df5['age'].mean()
#Fill the NA values with the mean
df5['age'].fillna(y, inplace=True) #Replaces the missing value with the mean y and elininataes the null type
df5

  animal  age  visits priority
a    cat  2.4       2      yes
b    cat  3.6       4      yes
c  snake  5.0       2       no
d    dog  4.0       1      yes
e    dog  3.0       7       no
f    rat  3.6       5       no

In [35]:
#drop missing data
df6 =df4.copy()
df6.dropna(how = 'any' ) # any implies any row with missing data

  animal  age  visits priority
a    cat  2.4       2      yes
c  snake  5.0       2       no
d    dog  4.0       1      yes
e    dog  3.0       7       no

# DataFrame file operations

In [36]:
df7 = df5.copy()

In [37]:
# Saving df to cd as csv file
df7.to_csv('anilmal.csv')

In [38]:
# Saving df to specified directory as csv file
# r before the path eliminates the need for escaping each'\'. 
df7.to_csv(r'E:\DATA SCIENCE\pandas\anilmal.csv')

In [39]:
# Saving to an excel sheet as '.xlsx'
#df7.to_excel(r'E:\DATA SCIENCE\pandas\anilmal1.xlsx', sheet_name = 'Sheet1')

In [40]:
#df7.to_excel(r'E:\DATA SCIENCE\pandas\anilmal.xlsx',
            #'Sheet1', index_col = None, na_values=['NA'])

In [41]:
#Loading a csv file to a DataFrame
df8 = pd.read_csv('anilmal.csv')  #for file in the working directory
df8

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.4       2      yes
1          b    cat  3.6       4      yes
2          c  snake  5.0       2       no
3          d    dog  4.0       1      yes
4          e    dog  3.0       7       no
5          f    rat  3.6       5       no

In [42]:
##Loading an excel file to a DataFrame

## pandas.DataFrame.groupby
>>  DataFrame.groupby(self, by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=False, observed=False, **kwargs)

- This can be used to group large amounts of data and compute operations on these groups.

In [50]:
# Example
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                 'Max Speed': [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [49]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [44]:
# agg() helps combine functions provided in a list
df.groupby(['Animal']).agg(['mean','max'])

       Max Speed
            mean    max
Animal
Falcon     375.0  380.0
Parrot      25.0   26.0

### df.groupby keys and subdata frames

In [45]:
for key, subdf in df8.groupby('animal'):
    print("key->",key)#printa the groupby key
    print("\nsub_dataframe\n",subdf)#prints the subdataframe

key-> cat

sub_dataframe
   Unnamed: 0 animal  age  visits priority
0          a    cat  2.4       2      yes
1          b    cat  3.6       4      yes
key-> dog

sub_dataframe
   Unnamed: 0 animal  age  visits priority
3          d    dog  4.0       1      yes
4          e    dog  3.0       7       no
key-> rat

sub_dataframe
   Unnamed: 0 animal  age  visits priority
5          f    rat  3.6       5       no
key-> snake

sub_dataframe
   Unnamed: 0 animal  age  visits priority
2          c  snake  5.0       2       no

## DataFrame/Series.apply() method
- used to apply a python function to a df or Series
- youtube: https://www.youtube.com/watch?v=P_q0tkYqvSk

In [46]:
#As a serie method
#The apply method will apply a function to each element of the series
df3 = df2.copy()
df3

  animal  age  visits priority
a    cat    2       2      yes
b    cat    5       4      yes
c  snake    2       2       no
d    dog    4       1      yes
e    dog    3       7       no
f    rat    2       5       no

In [47]:
#lets create a new column containing the length of the animal strings
#we shall deploy the python method using the pandas apply method

df3['animal_string_length'] = df3['animal'].apply(len)
df3

  animal  age  visits priority  animal_string_length
a    cat    2       2      yes                     3
b    cat    5       4      yes                     3
c  snake    2       2       no                     5
d    dog    4       1      yes                     3
e    dog    3       7       no                     3
f    rat    2       5       no                     3

In [48]:
# Apply to to a DataFrame
# Applies a function on either axis of a DataFrame

# Date and time operations

# converting to timestamp datatime
- use "pd.to_datetime" or "pd.timestamp"
- used similarly but the second does not take in the datefirst flag

In [60]:
#timestamp default format "year,month,day,min,sec"
x = pd.to_datetime("11/06/2019 12:08" ) #converts string to deafult timestamp
x

Timestamp('2019-11-06 12:08:00')

In [58]:
type(x)

pandas._libs.tslibs.timestamps.Timestamp

In [69]:
#if you use data that starts with the dayfirst(european format), pass the dayfirst flag
x = pd.to_datetime("22/06/2019 12:08",dayfirst = True ) #converts european format
x

Timestamp('2019-06-22 12:08:00')

In [65]:
#get date
y = pd.Timestamp.date(x)
y

datetime.date(2019, 6, 22)

In [68]:
type(u)

datetime.time

In [66]:
#get time
u = pd.Timestamp.time(x)
u

datetime.time(12, 8)

In [67]:
type(u)

datetime.time

In [ ]:

pgroupby.